{
  "backend/main.mo": "Main Motoko actor for the CivicSense backend defining data types (submissions, comments, votes, user profiles) and core logic including authentication via Internet Identity, role-based access control, and CRUD operations for civic issue submissions.",
  "feature_evidence.json": "Feature evidence report identifying two high-confidence bugs: incorrect conditional rendering in HomePage.tsx serving PublicPortal to authenticated users, and mismatched sessionStorage keys between LoginSelectionModal.tsx and HomePage.tsx causing role propagation failures.",
  "frontend-file-summaries.txt": "Concise per-file summaries of all frontend source files describing their purpose and notable fixes, such as corrected enum values, fixed hook imports, and sessionStorage key alignment for role-based portal routing.",
  "frontend/CURRENT_VS_INITIAL_DIFFERENCES.md": "Documents the differences between the current implementation (Version 35) and the initial design, concluding that most components closely match the initial state with only minor styling refinements and no major structural divergences.",
  "frontend/index.css": "Global CSS file defining the OKLCH-based design token system for light and dark modes using Tailwind's @layer base, covering background, foreground, primary, chart, and sidebar color variables.",
  "frontend/index.html": "Minimal HTML entry point for the CivicSense React app, setting the page title and mounting the root div with the main.tsx module script.",
  "frontend/INITIAL_DESIGN_STATE.md": "Describes the true initial design state of the CivicSense frontend, specifying component layouts, color system, Tailwind configuration, and the absence of gradients or special effects across all major components.",
  "frontend/src/App.tsx": "Root application component that wraps the app in ThemeProvider, renders Header, Footer, HomePage, and global modals (ProfileSetupModal, LoginSelectionModal, Toaster), and handles initialization loading state.",
  "frontend/src/components/CategoryStatsCards.tsx": "Displays a grid of stat cards for civic issue categories (Garbage, Traffic, Streetlight), showing total counts and status badges (Resolved, Pending, Reporting) fetched from all issues. Includes a skeleton loading state.",
  "frontend/src/components/CivicSenseAnimation.tsx": "Renders a static 'About' section with three value cards (Cleanliness, Safety, Responsibility) using Lucide icons in a responsive grid layout.",
  "frontend/src/components/DashboardSection.tsx": "Municipal dashboard section displaying analytics stats cards, bar/pie charts for issue status and category distribution, and an issue management table with a seed demo data button.",
  "frontend/src/components/Footer.tsx": "Simple footer component showing a copyright notice with a heart icon, a caffeine.ai attribution link, and a civic engagement tagline.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with the CivicSense logo, role-aware nav links (citizen vs. municipal staff), authentication controls (login/logout via Internet Identity), and a responsive mobile menu.",
  "frontend/src/components/HeroSection.tsx": "Hero section with a watercolor cityscape background, a headline, a category/location search UI, a 'Report Now' CTA button, and a CategoryStatsCards grid on the right column.",
  "frontend/src/components/HowItWorksSection.tsx": "Renders a three-step workflow section (Report Issue → Authority Reviews → Issue Resolved) as numbered cards with connecting arrows in a responsive grid.",
  "frontend/src/components/IssueCard.tsx": "Renders a compact card for a single civic issue, displaying its title, status badge, category, creation date, and upvote count with hover animation.",
  "frontend/src/components/IssueDetailDialog.tsx": "Modal dialog showing full details of a civic issue including attachments with image carousel, voting controls, comment thread, and status history.",
  "frontend/src/components/IssueManagementTable.tsx": "Admin table listing all issues with status badges and an edit dialog that allows municipal operators to update an issue's status with optional notes.",
  "frontend/src/components/IssuesSection.tsx": "Page section displaying the authenticated user's reported issues with a status summary strip, and prompts unauthenticated users to log in.",
  "frontend/src/components/LiveStatsSection.tsx": "Placeholder component that currently renders nothing (returns null).",
  "frontend/src/components/LoginSelectionModal.tsx": "Multi-step login modal that handles Internet Identity authentication, waits for a principal, then calls the backend login to determine and store the user's role (public or municipal).",
  "frontend/src/components/MapSection.tsx": "Displays a grid of civic issues that have location data, showing coordinates and address alongside a color-coded status legend; no interactive map library is used.",
  "frontend/src/components/MunicipalPortal.tsx": "Renders the Municipal Portal page with a banner and dashboard section, and auto-scrolls to the dashboard if flagged via sessionStorage from the login flow.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects a new user's name, email, and phone to create their profile, with UI adapting based on whether the user intended to register as municipal staff.",
  "frontend/src/components/PublicPortal.tsx": "Composes the public-facing landing page by assembling hero, statistics, how-it-works, issues, map, and animation sections along with a report issue dialog.",
  "frontend/src/components/ReportIssueDialog.tsx": "A dialog form for submitting a new civic issue, with auto-geolocation and reverse geocoding, image upload support, and fields for title, description, category, and priority.",
  "frontend/src/components/StatisticsSection.tsx": "Displays live community impact statistics (total issues raised, resolved, and resolution rate) fetched from the backend in a three-card grid layout.",
  "frontend/src/components/StatisticsStrip.tsx": "Renders a static strip of four platform-wide statistics (reports submitted, issues resolved, active areas, registered citizens) with icon images.",
  "frontend/src/components/SuccessBanner.tsx": "Shows a dismissible success banner announcing resolved issues today, which auto-hides after 10 seconds.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an authenticated or anonymous ICP backend actor based on the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login, logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including login, user profile, admin status, and issue (submission) CRUD operations with cache invalidation and toast notifications.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines CSS custom properties for the light and dark color themes (navy, orange, beige palette).",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/HomePage.tsx": "Root page component that conditionally renders MunicipalPortal or PublicPortal based on the authenticated user's role, using profile data, admin status, and sessionStorage to avoid flash-of-wrong-portal.",
  "frontend/src/utils/openLoginModal.ts": "Utility that opens the global login modal via a direct window function call or a custom DOM event fallback, with retry logic and error toasting.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage backing for persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with CSS-variable-based colors, custom border radii, accordion/fade animations, and the typography and animate plugins.",
  "project_state.json": "Project state metadata describing the CivicSense app's known bug (authenticated users incorrectly see PublicPortal) and the two existing fix-request features targeting HomePage.tsx and LoginSelectionModal.tsx role propagation."
}