{
  "backend/main.mo": "Main Motoko actor for the CivicSense backend, defining types and state for submissions, comments, votes, status updates, and user profiles, with mixins for blob storage and authorization.",
  "feature_evidence.json": "Feature evidence report mapping two implemented features—auto-geolocation in ReportIssueDialog and role-based hiding of the Report Issue button—to their source files and test IDs.",
  "frontend-file-summaries.txt": "Concise per-file summaries of all frontend source files, describing the purpose and key implementation details of each component, hook, page, and config file.",
  "frontend/CURRENT_VS_INITIAL_DIFFERENCES.md": "Documents the differences between the current Version 35 implementation and the initial design state, noting that most components closely match the initial design with only minor refinements.",
  "frontend/index.css": "Global CSS file defining OKLCH-based design tokens for light and dark modes using Tailwind's base layer, covering background, foreground, primary, chart, and sidebar color variables.",
  "frontend/index.html": "HTML entry point for the CivicSense React app, setting the page title and mounting the root div with the main TSX module.",
  "frontend/INITIAL_DESIGN_STATE.md": "Describes the true initial design state of the CivicSense frontend, specifying the original component layouts, theme configuration, and styling approach before any mockup-matching modifications.",
  "frontend/src/App.tsx": "Root React component that wraps the app in ThemeProvider, handles authentication state, shows a loading spinner during initialization, and conditionally renders the profile setup modal and login modal.",
  "frontend/src/components/CategoryStatsCards.tsx": "Displays a grid of stat cards per issue category (e.g., Garbage, Traffic, Streetlight) showing total counts and status badges (Resolved, Pending, Reporting), with skeleton loading states while issues are fetched.",
  "frontend/src/components/CivicSenseAnimation.tsx": "Renders a static 'About' section with three value cards (Cleanliness, Safety, Responsibility) using Lucide icons in a responsive grid layout.",
  "frontend/src/components/DashboardSection.tsx": "Renders the municipal dashboard with summary stat cards, bar and pie charts for issue status/category breakdowns, and a tabbed issue management table using analytics and issues data.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying a copyright notice with a heart icon and a tagline about civic engagement.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with the CivicSense logo, desktop/mobile nav links, and authentication controls (login, sign-up, user avatar dropdown, admin/staff shortcuts) using Internet Identity.",
  "frontend/src/components/HeroSection.tsx": "Hero section with a watercolor cityscape background, headline text, a category/location search bar, a 'Report Now' CTA button, and a CategoryStatsCards grid on the right column.",
  "frontend/src/components/HowItWorksSection.tsx": "Displays a three-step workflow section ('Report Issue', 'Authority Reviews', 'Issue Resolved') as numbered cards with arrows between them in a responsive grid.",
  "frontend/src/components/IssueCard.tsx": "Renders a clickable card for a single civic issue, displaying its title, status badge, category, creation date, and upvote count fetched via a query hook.",
  "frontend/src/components/IssueDetailDialog.tsx": "Modal dialog showing full details of a civic issue including images, comments, vote counts, and status history, with support for adding comments and casting votes.",
  "frontend/src/components/IssueManagementTable.tsx": "Admin table listing all civic issues with their category, status, priority, and creation date, allowing status updates with optional notes via an inline dialog.",
  "frontend/src/components/IssuesSection.tsx": "Page section displaying all issues and the current user's reported issues in tabs, with a conditional 'Report Issue' button hidden from municipal staff.",
  "frontend/src/components/LiveStatsSection.tsx": "Placeholder component that currently renders nothing (returns null).",
  "frontend/src/components/LoginSelectionModal.tsx": "Multi-step login modal that handles Internet Identity authentication followed by a backend login call, supporting both public user and municipal operator roles with retry logic and stage tracking.",
  "frontend/src/components/MapSection.tsx": "Displays a grid of civic issues that have location data, showing coordinates and address alongside a color-coded status legend; falls back to empty-state UI when no location data exists.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog component that collects user profile information (name, email, phone) on first login, supporting both citizen and municipal staff roles, and saves the profile via a mutation hook.",
  "frontend/src/components/ReportIssueDialog.tsx": "A dialog form for submitting new civic issues with title, description, category, location (auto-detected via geolocation with reverse geocoding), and image attachments with upload progress tracking.",
  "frontend/src/components/StatisticsSection.tsx": "Displays community impact statistics (total issues raised, issues resolved, resolution rate) in a card grid, computed from all issues fetched via a query hook.",
  "frontend/src/components/StatisticsStrip.tsx": "A horizontal strip showing platform-level stats (reports submitted, issues resolved, active areas, registered citizens) using live data when available or fallback placeholder values.",
  "frontend/src/components/SuccessBanner.tsx": "A dismissible banner that displays a success message about resolved issues and auto-hides after 10 seconds.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an authenticated or anonymous ICP backend actor based on the current Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status using the DFINITY AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including login, user profile management, issue (submission) CRUD, comments, voting, and admin operations using the actor pattern.",
  "frontend/src/hooks/useSeedData.ts": "Hook that seeds sample civic issue data into the backend once per browser session when an authenticated user is present, then invalidates relevant queries to refresh the UI.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines CSS custom properties for the app's color system (navy, orange, beige) in both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/HomePage.tsx": "Home page component that conditionally renders a public landing view (hero, stats, how-it-works) for unauthenticated users or a dashboard view with issues, map, and admin sections for authenticated users.",
  "frontend/src/utils/openLoginModal.ts": "Utility that opens the global login modal by first attempting a direct window function call, then falling back to a custom DOM event, with retry logic on failure.",
  "frontend/src/utils/seedData.ts": "Defines sample civic issue data for Bangalore and a seedSampleData function that submits these issues to the backend, guarded by a localStorage key to prevent duplicate seeding.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that maps CSS custom properties to semantic color tokens, extends border radius, and adds accordion and fade animation keyframes.",
  "project_state.json": "Tracks project state (version 5) for fixing broken Public and Municipal portals, listing known issues, existing features, and six pending action requests covering portal access, routing, auth flow, backend queries, location auto-fetch, and Report Issue visibility."
}