{
  "kind": "build_request",
  "title": "Auto-fetch location on Report Issue open and hide Report Issue from Municipal portal",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-5",
      "text": "In ReportIssueDialog.tsx, automatically trigger the browser Geolocation API to fetch the user's current coordinates as soon as the dialog is opened, pre-filling the location fields without requiring the user to click any button.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "it should fetch location automatically when reporting issue"
        ]
      },
      "acceptanceCriteria": [
        "When the Report Issue dialog opens, the browser geolocation prompt is triggered immediately.",
        "If geolocation succeeds, latitude/longitude (and address if reverse-geocoded) are pre-filled in the location field.",
        "If geolocation is denied or unavailable, the location field remains editable and an inline message informs the user.",
        "The user can still manually edit or override the auto-fetched location."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Ensure the Report Issue button and the ReportIssueDialog are only rendered in the Public (citizen) portal view. In the Municipal portal view (authenticated municipal operator role), the Report Issue entry point and dialog must not be visible or accessible.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "reporting issue section is only shown in public portal not in municipal portal"
        ]
      },
      "acceptanceCriteria": [
        "When logged in as a municipal operator, the Report Issue button does not appear anywhere in the UI.",
        "The ReportIssueDialog cannot be opened from the municipal portal view.",
        "When logged in as a citizen or unauthenticated public user, the Report Issue button remains visible and functional.",
        "The IssuesSection and any other components that render the Report Issue button conditionally hide it based on the user's role."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "Role-based visibility must use the existing authentication and role state already available in the app (e.g., from useInternetIdentity or user profile hooks)."
  ],
  "nonGoals": [
    "Adding a map-based location picker UI.",
    "Storing or displaying geolocation data on the Municipal dashboard.",
    "Changing the Municipal portal dashboard layout or features beyond hiding Report Issue."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}