{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Auto-fetch location on Report Issue open and hide Report Issue from Municipal portal",
  "requirements": [
    {
      "id": "REQ-5",
      "summary": "Auto-fetch user location when Report Issue dialog opens",
      "acceptanceCriteria": [
        "When the Report Issue dialog opens, the browser geolocation prompt is triggered immediately.",
        "If geolocation succeeds, latitude/longitude (and address if reverse-geocoded) are pre-filled in the location field.",
        "If geolocation is denied or unavailable, the location field remains editable and an inline message informs the user.",
        "The user can still manually edit or override the auto-fetched location."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ReportIssueDialog.tsx",
          "operation": "modify",
          "description": "Add useEffect hook that triggers browser Geolocation API when dialog opens (when 'open' prop becomes true). Call navigator.geolocation.getCurrentPosition() to fetch coordinates and pre-fill latitude/longitude fields. Optionally reverse-geocode coordinates to address fields. Handle geolocation errors (denied/unavailable) by setting inline error message state and keeping fields editable. Ensure manual editing remains possible by not blocking user input."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Hide Report Issue button and dialog from Municipal portal view",
      "acceptanceCriteria": [
        "When logged in as a municipal operator, the Report Issue button does not appear anywhere in the UI.",
        "The ReportIssueDialog cannot be opened from the municipal portal view.",
        "When logged in as a citizen or unauthenticated public user, the Report Issue button remains visible and functional.",
        "The IssuesSection and any other components that render the Report Issue button conditionally hide it based on the user's role."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/IssuesSection.tsx",
          "operation": "modify",
          "description": "Add role-based conditional rendering to hide the Report Issue button when user profile indicates isMunicipalStaff is true. Use the existing useGetCallerUserProfile hook to fetch user profile and check the isMunicipalStaff field. Only render the Report Issue Button component when user is not municipal staff or is unauthenticated."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "If the Header component contains a Report Issue button or link in navigation, add role-based conditional rendering to hide it when user profile indicates isMunicipalStaff is true. Use the existing useGetCallerUserProfile hook to check the isMunicipalStaff field and conditionally render the navigation item."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Review and ensure the Report Issue entry point in the hero section or public landing view is only visible when user is not a municipal operator. Use the existing useGetCallerUserProfile hook to check isMunicipalStaff field and conditionally render any Report Issue buttons in the public landing view."
        }
      ]
    }
  ]
}