{
  "backend/main.mo": "Main backend actor implementing a civic issue reporting system with user profiles, submissions (with categories, priorities, statuses), comments, votes, status updates, blob storage, and access control authorization.",
  "feature_evidence.json": "Feature evidence report documenting that version 35 UI does not match the original initial design, listing affected frontend files and components with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components describing their current state with inline documentation confirming they match the initial design without mockup-matching enhancements.",
  "frontend/CURRENT_VS_INITIAL_DIFFERENCES.md": "Component-by-component analysis documenting that version 35 is a simplified restoration removing mockup-matching enhancements (gradients, custom images, effects) and closely matches the initial design with possible minor implementation differences.",
  "frontend/index.css": "Global CSS defining OKLCH color system tokens for light and dark modes using CSS custom properties with standard shadcn/ui palette structure.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title 'CivicSense - Civic Issue Reporting Platform', root div, and module script reference to main.tsx.",
  "frontend/INITIAL_DESIGN_STATE.md": "Detailed specification of the true initial design state before mockup-matching, describing a clean functional platform with standard shadcn/ui components, neutral HSL colors, and no visual flair effects.",
  "frontend/src/App.tsx": "Root application component managing authentication state, profile setup modal display logic, theme provider, and main layout structure with header, home page, footer, and toaster notifications.",
  "frontend/src/components/CivicSenseAnimation.tsx": "About section component displaying three civic value cards (Cleanliness, Safety, Responsibility) with Lucide icons in a responsive grid layout. Uses standard theme styling without animations or custom images.",
  "frontend/src/components/DashboardSection.tsx": "Municipal dashboard component showing analytics with stats cards, pie/bar charts for status and category distribution, and tabbed interface for managing all issues and assigned issues. Includes IssueManagementTable integration and uses Recharts for visualizations.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice with caffeine.ai attribution and a tagline about civic engagement. Uses responsive flex layout with Heart icon.",
  "frontend/src/components/Header.tsx": "Sticky header with branding, navigation, and authentication UI. Shows login button for guests, avatar dropdown for authenticated users, and dashboard link for municipal staff/admins. Includes mobile sheet menu.",
  "frontend/src/components/HeroSection.tsx": "Landing page hero section with centered heading, description, and 'Get Started' CTA button that triggers login modal. Uses standard background styling without images or gradients.",
  "frontend/src/components/IssueCard.tsx": "Card component displaying issue summary with title, description, status badge, category, timestamp, and upvote count. Clickable card with hover effects and color-coded status badges.",
  "frontend/src/components/IssueDetailDialog.tsx": "Modal dialog showing full issue details including images (with gallery navigation), status history, voting functionality, and comments section. Handles image loading, vote management, and comment submission with authentication checks.",
  "frontend/src/components/IssueManagementTable.tsx": "Displays a table of civic issues for municipal operators with status badges, priority indicators, and a dialog to update issue status with notes. Includes status color coding and formatting for dates and categories.",
  "frontend/src/components/IssuesSection.tsx": "Main section component for browsing and reporting civic issues with tabs for 'All Issues' and 'My Reports', including authentication checks and dialogs for reporting and viewing issue details.",
  "frontend/src/components/LiveStatsSection.tsx": "Empty placeholder component that returns null, likely intended for future live statistics display.",
  "frontend/src/components/LoginSelectionModal.tsx": "Multi-stage authentication modal that handles Internet Identity login and backend role selection (public/municipal), with retry logic, timeout handling, and state management for the authentication flow.",
  "frontend/src/components/MapSection.tsx": "Displays a geographic view of reported issues with location data, showing coordinates and addresses in a grid layout with status color indicators and a legend.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal form for completing user profile setup after authentication, collecting name, email, and phone with role-based UI (municipal vs public) and automatic navigation after completion.",
  "frontend/src/components/ReportIssueDialog.tsx": "Dialog component for reporting civic issues with form fields for category, title, description, location, address, and multiple image uploads with preview and progress tracking. Handles validation, image upload to backend, and issue creation with proper error handling.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on authentication state, initializing with admin token when authenticated and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and providing login/logout functions with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend operations including login, user profiles, issues (submissions), comments, votes, status updates, and file attachments with proper cache invalidation and error handling.",
  "frontend/src/index.css": "Tailwind CSS configuration with HSL-based color system defining light and dark mode themes using standard shadcn/ui tokens plus a success color for status indicators.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/HomePage.tsx": "Main page component with conditional rendering: shows hero and animation sections for unauthenticated users, and issues/map/dashboard sections for authenticated users with auto-scroll to dashboard for municipal staff after login.",
  "frontend/src/utils/openLoginModal.ts": "Utility function to reliably trigger the global login modal using direct function call with custom event fallback and retry logic, ensuring the modal opens even if not immediately available.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme with HSL CSS variables, container settings, border radius variables, accordion animations, and typography/animate plugins.",
  "project_state.json": "Project state tracking document (v17) indicating a request to restore the UI to its original design, reversing previous mockup-matching restyle work, with feature history and known issues."
}